src/Documents/bz_ВыполнениеРабот/bz_ВыполнениеРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>bz_ВыполнениеРабот</name>
  <registerRecords>AccumulationRegister.bz_РаботыКВыставлению</registerRecords>
  <registerRecords>AccumulationRegister.bz_Выработка</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.bz_Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Этап</name>
    <type>
      <types>CatalogRef.bz_ЭтапыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Трудозатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.bz_Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.bz_ЭтапыПроектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.bz_Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрудозатратыЧ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТрудозатратыМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПВРСтроки</name>
      <type>
        <types>CatalogRef.bz_ПозицияВыполненияРабот</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/bz_ВыполнениеРабот/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Если Объект.Организация.Пустая() Тогда 
			ОсновнаяОрганизация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
			Справочники.Организации.ПроверитьНаличиеОрганизацииПриОднофирменномУчете(ОсновнаяОрганизация);
			Объект.Организация = ОсновнаяОрганизация;
		КонецЕсли;
		Если Объект.Сотрудник.Пустая() Тогда 
			ТекПользователь = Пользователи.ТекущийПользователь();
			Если ЗначениеЗаполнено(ТекПользователь) Тогда
				Объект.Сотрудник = ТекПользователь.ФизическоеЛицо;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаботыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока и не Копирование Тогда 
		ТекСтр = Элементы.Работы.ТекущиеДанные;
		Если ТекСтр = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если не Объект.Проект.Пустая() Тогда
			ТекСтр.Проект = Объект.Проект;
			Если не Объект.Этап.Пустая() Тогда
				ТекСтр.Этап = Объект.Этап;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
